Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV128GM106.h
/* C1RXF15SID */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */
/* Bitname _SID cannot be defined because it is used by more than one SFR */

/* C1RXF15EID */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID cannot be defined because it is used by more than one SFR */

/* SENT1CON1 */
/* Bitname _NIBCNT cannot be defined because it is used by more than one SFR */
/* Bitname _PS cannot be defined because it is used by more than one SFR */
/* Bitname _SPCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PPP cannot be defined because it is used by more than one SFR */
/* Bitname _CRCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _TXM cannot be defined because it is used by more than one SFR */
/* Bitname _RCVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SNTSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SNTEN cannot be defined because it is used by more than one SFR */

/* SENT1STAT */
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
/* Bitname _RXIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERR cannot be defined because it is used by more than one SFR */
/* Bitname _CRCERR cannot be defined because it is used by more than one SFR */
/* Bitname _NIB cannot be defined because it is used by more than one SFR */
/* Bitname _PAUSE cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */
/* Bitname _NIB0 cannot be defined because it is used by more than one SFR */
/* Bitname _NIB1 cannot be defined because it is used by more than one SFR */
/* Bitname _NIB2 cannot be defined because it is used by more than one SFR */

/* SENT1DATL */
/* Bitname _CRC cannot be defined because it is used by more than one SFR */
/* Bitname _DATA6 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA5 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA4 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC2 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC3 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA60 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA61 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA62 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA63 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA50 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA51 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA52 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA53 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA40 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA41 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA42 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA43 cannot be defined because it is used by more than one SFR */

/* SENT1DATH */
/* Bitname _DATA3 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA2 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA1 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _DATA30 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA31 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA32 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA33 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA20 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA21 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA22 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA23 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA10 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA11 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA12 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA13 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT2 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT3 cannot be defined because it is used by more than one SFR */

/* SENT2CON1 */
/* Bitname _NIBCNT cannot be defined because it is used by more than one SFR */
/* Bitname _PS cannot be defined because it is used by more than one SFR */
/* Bitname _SPCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PPP cannot be defined because it is used by more than one SFR */
/* Bitname _CRCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _TXM cannot be defined because it is used by more than one SFR */
/* Bitname _RCVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SNTSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SNTEN cannot be defined because it is used by more than one SFR */

