Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV128GM106.h
#define _RPOR8_RP70R2_POSITION                   0x0000000A
#define _RPOR8_RP70R2_MASK                       0x00000400
#define _RPOR8_RP70R2_LENGTH                     0x00000001

#define _RPOR8_RP70R3_POSITION                   0x0000000B
#define _RPOR8_RP70R3_MASK                       0x00000800
#define _RPOR8_RP70R3_LENGTH                     0x00000001

#define _RPOR8_RP70R4_POSITION                   0x0000000C
#define _RPOR8_RP70R4_MASK                       0x00001000
#define _RPOR8_RP70R4_LENGTH                     0x00000001

#define _RPOR8_RP70R5_POSITION                   0x0000000D
#define _RPOR8_RP70R5_MASK                       0x00002000
#define _RPOR8_RP70R5_LENGTH                     0x00000001

#define _RPOR9_RP97R_POSITION                    0x00000000
#define _RPOR9_RP97R_MASK                        0x0000003F
#define _RPOR9_RP97R_LENGTH                      0x00000006

#define _RPOR9_RP118R_POSITION                   0x00000008
#define _RPOR9_RP118R_MASK                       0x00003F00
#define _RPOR9_RP118R_LENGTH                     0x00000006

#define _RPOR9_RP97R0_POSITION                   0x00000000
#define _RPOR9_RP97R0_MASK                       0x00000001
#define _RPOR9_RP97R0_LENGTH                     0x00000001

#define _RPOR9_RP97R1_POSITION                   0x00000001
#define _RPOR9_RP97R1_MASK                       0x00000002
#define _RPOR9_RP97R1_LENGTH                     0x00000001

#define _RPOR9_RP97R2_POSITION                   0x00000002
#define _RPOR9_RP97R2_MASK                       0x00000004
#define _RPOR9_RP97R2_LENGTH                     0x00000001

#define _RPOR9_RP97R3_POSITION                   0x00000003
#define _RPOR9_RP97R3_MASK                       0x00000008
#define _RPOR9_RP97R3_LENGTH                     0x00000001

#define _RPOR9_RP97R4_POSITION                   0x00000004
#define _RPOR9_RP97R4_MASK                       0x00000010
#define _RPOR9_RP97R4_LENGTH                     0x00000001

#define _RPOR9_RP97R5_POSITION                   0x00000005
#define _RPOR9_RP97R5_MASK                       0x00000020
#define _RPOR9_RP97R5_LENGTH                     0x00000001

#define _RPOR9_RP118R0_POSITION                  0x00000008
#define _RPOR9_RP118R0_MASK                      0x00000100
#define _RPOR9_RP118R0_LENGTH                    0x00000001

#define _RPOR9_RP118R1_POSITION                  0x00000009
#define _RPOR9_RP118R1_MASK                      0x00000200
#define _RPOR9_RP118R1_LENGTH                    0x00000001

#define _RPOR9_RP118R2_POSITION                  0x0000000A
#define _RPOR9_RP118R2_MASK                      0x00000400
#define _RPOR9_RP118R2_LENGTH                    0x00000001

#define _RPOR9_RP118R3_POSITION                  0x0000000B
#define _RPOR9_RP118R3_MASK                      0x00000800
#define _RPOR9_RP118R3_LENGTH                    0x00000001

#define _RPOR9_RP118R4_POSITION                  0x0000000C
#define _RPOR9_RP118R4_MASK                      0x00001000
#define _RPOR9_RP118R4_LENGTH                    0x00000001

#define _RPOR9_RP118R5_POSITION                  0x0000000D
#define _RPOR9_RP118R5_MASK                      0x00002000
#define _RPOR9_RP118R5_LENGTH                    0x00000001

#define _RPOR10_RP120R_POSITION                  0x00000000
#define _RPOR10_RP120R_MASK                      0x0000003F
#define _RPOR10_RP120R_LENGTH                    0x00000006

#define _RPOR10_RP176R_POSITION                  0x00000008
#define _RPOR10_RP176R_MASK                      0x00003F00
#define _RPOR10_RP176R_LENGTH                    0x00000006

#define _RPOR10_RP120R0_POSITION                 0x00000000
#define _RPOR10_RP120R0_MASK                     0x00000001
#define _RPOR10_RP120R0_LENGTH                   0x00000001

#define _RPOR10_RP120R1_POSITION                 0x00000001
#define _RPOR10_RP120R1_MASK                     0x00000002
#define _RPOR10_RP120R1_LENGTH                   0x00000001

#define _RPOR10_RP120R2_POSITION                 0x00000002
#define _RPOR10_RP120R2_MASK                     0x00000004
#define _RPOR10_RP120R2_LENGTH                   0x00000001

#define _RPOR10_RP120R3_POSITION                 0x00000003
#define _RPOR10_RP120R3_MASK                     0x00000008
#define _RPOR10_RP120R3_LENGTH                   0x00000001

#define _RPOR10_RP120R4_POSITION                 0x00000004
#define _RPOR10_RP120R4_MASK                     0x00000010
#define _RPOR10_RP120R4_LENGTH                   0x00000001

#define _RPOR10_RP120R5_POSITION                 0x00000005
#define _RPOR10_RP120R5_MASK                     0x00000020
#define _RPOR10_RP120R5_LENGTH                   0x00000001

#define _RPOR10_RP176R0_POSITION                 0x00000008
#define _RPOR10_RP176R0_MASK                     0x00000100
#define _RPOR10_RP176R0_LENGTH                   0x00000001

#define _RPOR10_RP176R1_POSITION                 0x00000009
#define _RPOR10_RP176R1_MASK                     0x00000200
#define _RPOR10_RP176R1_LENGTH                   0x00000001

#define _RPOR10_RP176R2_POSITION                 0x0000000A
#define _RPOR10_RP176R2_MASK                     0x00000400
#define _RPOR10_RP176R2_LENGTH                   0x00000001

#define _RPOR10_RP176R3_POSITION                 0x0000000B
#define _RPOR10_RP176R3_MASK                     0x00000800
#define _RPOR10_RP176R3_LENGTH                   0x00000001

#define _RPOR10_RP176R4_POSITION                 0x0000000C
#define _RPOR10_RP176R4_MASK                     0x00001000
#define _RPOR10_RP176R4_LENGTH                   0x00000001

#define _RPOR10_RP176R5_POSITION                 0x0000000D
#define _RPOR10_RP176R5_MASK                     0x00002000
#define _RPOR10_RP176R5_LENGTH                   0x00000001

#define _RPOR11_RP177R_POSITION                  0x00000000
#define _RPOR11_RP177R_MASK                      0x0000003F
#define _RPOR11_RP177R_LENGTH                    0x00000006

#define _RPOR11_RP178R_POSITION                  0x00000008
#define _RPOR11_RP178R_MASK                      0x00003F00
#define _RPOR11_RP178R_LENGTH                    0x00000006

#define _RPOR11_RP177R0_POSITION                 0x00000000
#define _RPOR11_RP177R0_MASK                     0x00000001
#define _RPOR11_RP177R0_LENGTH                   0x00000001

#define _RPOR11_RP177R1_POSITION                 0x00000001
#define _RPOR11_RP177R1_MASK                     0x00000002
#define _RPOR11_RP177R1_LENGTH                   0x00000001

